import constant

l = [constant.PI,4,7,6,0,9,11,2,"hello","world"]

print(l[1])

l[1] = 30 #таким образом можно поменять значение в list просто обратившись по индексу

print(l[1])
print(l[0])
print(l[8:10]) #правое значение должно быть больше целевого окончания на один иначе не захватит в вывод


c = (1,7,9,6,48,23,"hello world!")

print(c[0])


a = {1,8,7,6,3,2,4,1,"hello world!",8,7}

print(a)
print(type(a))

d = {1:"hello" , 2:"world!"}

print(d[1],d[2])


k = set([1,1,2,2,3,3]) #можно так же преобразовывать всё как и с обычными значениями
print(k)